app/Models/ModelAdmin.php

SELECT *
FROM `tbl_kas_masjid`
WHERE month(tanggal) = '08'
AND year(tanggal) = '2024'
---
    public function AllDataKasMasjid()
    {
        return $this->db->table('tbl_kas_masjid')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();