app/Models/ModelKasMasjid.php

    public function AllData()
    {
        return $this->db->table('tbl_kas_masjid')
            ->orderBy('tanggal', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_kas_masjid`
ORDER BY `tanggal` ASC

    public function getTotalPemasukanBulanIni()
    {
        return $this->db->table('tbl_kas_masjid')
            ->selectSum('kas_masuk')
            ->where('MONTH(tanggal)', date('m'))
            ->where('YEAR(tanggal)', date('Y'))
            ->get()
            ->getRowArray()['kas_masuk'];
---
SELECT SUM(`kas_masuk`) AS `kas_masuk`
FROM `tbl_kas_masjid`
WHERE MONTH(tanggal) = '08'
AND YEAR(tanggal) = '2024'

    public function getTotalPemasukanBulanLalu()
    {
        // Bulan lalu
        $bulan_lalu = date('m') - 1;
        $tahun_lalu = date('Y');
        if ($bulan_lalu == 0) {
            $bulan_lalu = 12;
            $tahun_lalu--;
        }

        return $this->db->table('tbl_kas_masjid')
            ->selectSum('kas_masuk')
            ->where('MONTH(tanggal)', $bulan_lalu)
            ->where('YEAR(tanggal)', $tahun_lalu)
            ->get()
            ->getRowArray()['kas_masuk'];
---
SELECT SUM(`kas_masuk`) AS `kas_masuk`
FROM `tbl_kas_masjid`
WHERE MONTH(tanggal) = 7
AND YEAR(tanggal) = '2024'