app/Models/ModelAgenda.php

    public function DetailData($id_agenda)
    {
        return $this->db->table('tbl_agenda')
            ->where('id_agenda', $id_agenda)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_agenda`
WHERE `id_agenda` = '7'

    public function AllDataKeuangan($id_agenda)
    {
        return $this->db->table('tbl_dana_kegiatan')
            ->where('id_agenda', $id_agenda)
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_dana_kegiatan`
WHERE `id_agenda` = '7'

    public function getTotalPemasukanDanPengeluaranPerEnamKegiatan()
    {
        return $this->db->table('tbl_dana_kegiatan D')
            ->select('A.nama_kegiatan AS kegiatan, A.id_agenda, SUM(D.pemasukan) AS total_pemasukan, SUM(D.pengeluaran) AS total_pengeluaran')
            ->join('tbl_agenda A', 'D.id_agenda = A.id_agenda')
            ->groupBy('A.id_agenda, A.nama_kegiatan')
            ->orderBy('A.id_agenda', 'DESC') // Menambahkan pengurutan berdasarkan id_agenda secara menurun
            ->limit(6) // Menambahkan batasan hanya 6 agenda yang ditampilkan
            ->get()
            ->getResultArray();
---
SELECT `A`.`nama_kegiatan` AS `kegiatan`, `A`.`id_agenda`, SUM(D.pemasukan) AS total_pemasukan, SUM(D.pengeluaran) AS total_pengeluaran
FROM `tbl_dana_kegiatan` `D`
JOIN `tbl_agenda` `A` ON `D`.`id_agenda` = `A`.`id_agenda`
GROUP BY `A`.`id_agenda`, `A`.`nama_kegiatan`
ORDER BY `A`.`id_agenda` DESC
 LIMIT 6